<script>
export default {
  name: "PrivacyPage",
};
</script>

<template>
  <Head>
    <Title>利用規約とプライバシーポリシー</Title>
  </Head>

  <h1>利用規約（プライバシーポリシーは下にあります）</h1>

  <p>
    この利用規約は，Circle4Devsがこのウェブサイト上で提供するサービス（以下「本サービス」）の利用条件を定めるものです。登録ユーザーの皆さまには，本規約に従って，本サービスをご利用いただきます。</p>

  <h2>適用</h2>
  <p>
    本規約は，ユーザーとCircle4Devsとの間の本サービスの利用に関わる一切の関係に適用されるものとします。Circle4Devsは本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定めをすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。</p>

  <h2>利用登録</h2>
  <p>
    本サービスにおいては，登録希望者が本規約に同意の上，Circle4Devsの定める方法によって利用登録を申請し，Circle4Devsがこの承認を登録希望者に通知することによって，利用登録が完了するものとします。Circle4Devsは，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。また、アカウントはお一人様１つまでとします。これを破った場合はアカウントが削除されるなどの処置がくだされます。</p>

  <h2>ユーザーIDおよびパスワードの管理</h2>
  <p>
    ユーザーは，自己の責任において，本サービスのユーザーIDおよびパスワードを適切に管理するものとします。ユーザーは，いかなる場合にも，ユーザーIDおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。Circle4Devsは，ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのユーザーIDを登録しているユーザー自身による利用とみなします。</p>

  <h2>未成年による利用</h2>
  <p>
    ユーザーが未成年である場合、法定代理人の同意を得た上で、本サービスをご利用ください。法定代理人の同意を得ずに本サービスのご利用を開始したユーザーが成年に達した場合、未成年者であった間の利用行為を追認したものとみなします</p>

  <h2>サービス内ポイント</h2>
  <p>
    ユーザーが本サービス上において投稿などの行為を行った場合、その行動に応じてポイントがそのユーザーに付与されます。このポイントは本サービスの副次的な特典としての性格を持ち、本サービスの障害、不具合、その他理由によりポイントが消失した場合も補償や復元を行わないものとします</p>

  <h2>禁止事項</h2>
  <p>ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
  <ul>
    <li>法令または公序良俗に違反する行為</li>
    <li>犯罪行為に関連する行為</li>
    <li>
      Circle4Devs，本サービスの他のユーザー，または第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
    </li>
    <li>Circle4Devsのサービスの運営を妨害するおそれのある行為</li>
    <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
    <li>不正アクセスをし，またはこれを試みる行為</li>
    <li>他のユーザーに成りすます行為</li>
    <li>Circle4Devsのサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</li>
    <li>
      Circle4Devs，本サービスの他のユーザーまたは第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為
    </li>
    <li>以下の表現を含み，または含むとCircle4Devsが判断する内容を本サービス上に投稿し，または送信する行為
      <ul>
        <li>過度に暴力的な表現</li>
        <li>露骨な性的表現</li>
        <li>人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現</li>
        <li>自殺，自傷行為，薬物乱用を誘引または助長する表現</li>
        <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
      </ul>
    </li>
    <li>以下を目的とし，または目的とするとCircle4Devsが判断する行為
      <ul>
        <li>営業，宣伝，広告，勧誘，その他営利を目的とする行為（Circle4Devsの認めたものを除きます。）</li>
        <li>性行為やわいせつな行為を目的とする行為</li>
        <li>面識のない異性との出会いや交際を目的とする行為</li>
        <li>他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為</li>
        <li>
          Circle4Devs，本サービスの他のユーザー，または第三者に不利益，損害または不快感を与えることを目的とする行為
        </li>
        <li>その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為</li>
      </ul>
    </li>
    <li>宗教活動または宗教団体への勧誘行為</li>
    <li>その他，Circle4Devsが不適切と判断する行為</li>
  </ul>

  <h2>反社会的勢力の排除</h2>
  <p>
    ユーザーは、次の各号のいずれか一にも該当しないことを表明し、かつ将来にわたっても該当しないことを表明し、保証するものとします：</p>
  <ol>
    <li>
      自ら（法人その他の団体にあっては、自らの役員を含みます。）が、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋、社会運動等標ぼうゴロまたは特殊知能暴力集団等その他これらに準じる者（以下総称して「暴力団員等」といいます。）であること
    </li>
    <li>ユーザーが法人その他の団体の場合にあっては、暴力団員等が経営を支配していると認められる関係を有すること
    </li>
    <li>
      ユーザーが法人その他の団体の場合にあっては、暴力団員等が経営に実質的に関与していると認められる関係を有すること
    </li>
    <li>
      自らもしくは第三者の不正の利益を図る目的または第三者に損害を加える目的をもって取引を行うなど、暴力団員等を利用していると認められる関係を有すること
    </li>
    <li>暴力団員等に対して資金等を提供し、または便宜を供与するなどの関与をしていると認められる関係を有すること
    </li>
    <li>
      ユーザーが法人その他の団体の場合にあっては、自らの役員または自らの経営に実質的に関与している者が暴力団員等と社会的に非難されるべき関係を有すること
    </li>
  </ol>
  <p>
    ユーザーは、自らまたは第三者を利用して次の各号のいずれか一にでも該当する行為を行わないことを保証するものとします：</p>
  <ul>
    <li>暴力的な要求行為</li>
    <li>法的な責任を超えた不当な要求行為</li>
    <li>取引に関して、脅迫的な言動をし、または暴力を用いる行為</li>
    <li>
      風説を流布し、偽計を用い、または威力を用いて、本サービスの信用を毀損し、または本サービスの業務を妨害する行為
    </li>
    <li>その他前各号に準ずる行為</li>
  </ul>
  <p>ユーザーは、利用登録後に本項目の違反に気付いた場合には、速やかに退会の手続きを行うものとします。</p>

  <h2>利用制限</h2>
  <p>
    Circle4Devsは，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，本サービスの全部もしくは一部の利用を制限できるものとします。</p>
  <ul>
    <li>本規約のいずれかの条項に違反した場合</li>
    <li>登録事項に虚偽の事実があることが判明した場合</li>
    <li>料金等の支払債務の不履行があった場合</li>
    <li>Circle4Devsからの連絡に対し，一定期間返答がない場合</li>
    <li>本サービスについて，最終の利用から一定期間利用がない場合</li>
    <li>その他，Circle4Devsが本サービスの利用を適当でないと判断した場合</li>
  </ul>
  <p>
    また、Circle4Devsが合理出来と判断した場合は、事前の通知なく、本サービスはユーザーのID情報等を一時的または恒久的に変更できるものとします。</p>

  <h2>退会</h2>
  <p>ユーザーは、本サービスの定める手続きにより、利用登録を抹消し、よって本サービスから退会できるものとします。</p>

  <h2>欧州からのアクセス</h2>
  <p>
    日本国外からのアクセスを禁止します。また、VPNなどを介して本サービスにアクセスした場合、日本国内からのアクセスとします。</p>

  <h2>本サービスの提供の停止等</h2>
  <p>
    Circle4Devsは，以下のいずれかの事由があると判断した場合，ユーザーに事前の通知なく，本サービスの提供を停止または中断することがあります。</p>
  <ul>
    <li>定期的な保守点検または急な修理が必要となった場合</li>
    <li>電子通信設備の維修・点検作業を行う場合</li>
    <li>地震，落雷，火災，風水害，停電などの不可抗力により，本サービスの提供が困難となった場合</li>
    <li>その他，Circle4Devsが本サービスの提供が困難と判断した場合</li>
  </ul>

  <h2>著作権</h2>
  <p>
    ユーザーが本サービスを利用することにより，ユーザー自身または第三者に対して発生する一切の著作権または他の権利を侵害してはなりません。</p>

  <h2>免責事項</h2>
  <p>Circle4Devsは、本サービスの利用によりユーザーまたは第三者に生じた損害について、一切の責任を負いません。</p>

  <h2>利用規約の変更</h2>
  <p>
    Circle4Devsは、必要と判断した場合には、ユーザーに通知することなく、本規約を変更できるものとします。Circle4Devsは、本規約を変更した場合、変更後の規約の効力発生日を本ウェブサイト上で掲示することにより効力発生とします。</p>

  <h2>連絡/通知</h2>
  <p>ユーザーとCircle4Devsとの間の通知または連絡は、Circle4Devsの定める方法によって行うものとします。</p>

  <h2>準拠法と管轄裁判所</h2>
  <p>
    本規約の解釈にあたっては、日本法を準拠法とします。本サービスに関して紛争が生じた場合、Circle4Devsの本店所在地を管轄する裁判所を専属的な合意管轄とします。</p>

  <p>
    以上が、利用規約の全文です。ユーザーは、本規約をよくお読みいただき、内容を理解した上で本サービスを利用してください。</p>
  <p>最終更新日: 2023年9月9日</p>

  <p>----------------------</p>

  <h1>プライバシーポリシー</h1>

  <h2>取得する情報</h2>
  <p>本サービスは、お客様から以下の情報を取得します:</p>
  <ul>
    <li>ユーザー名（ニックネーム）</li>
    <li>メールアドレス</li>
    <li>Cookie(クッキー)を用いて生成された識別情報（※個人情報を取得するためのものではございません）</li>
  </ul>

  <h2>情報の使用目的</h2>
  <p>本サービスは、お客様から取得した情報を以下の目的のために利用します:</p>
  <ul>
    <li>本サービスに関する登録の受付、お客様の本人確認、認証のため</li>
    <li>お客様の本サービスの利用履歴を管理するため</li>
    <li>利用料金の決済のため</li>
    <li>本サービスにおけるお客様の行動履歴を分析し、本サービスの維持改善に役立てるため</li>
    <li>お客様の趣味嗜好にあわせたターゲティング広告を表示するため</li>
    <li>本サービスのサービスに関するご案内をするため</li>
    <li>お客様からのお問い合わせに対応するため</li>
    <li>本サービスの規約や法令に違反する行為に対応するため</li>
    <li>本サービスの変更、提供中止、終了、契約解除をご連絡するため</li>
    <li>本サービス規約の変更等を通知するため</li>
    <li>以上の他、本サービスの提供、維持、保護及び改善のため</li>
  </ul>

  <h2>安全管理のために講じた措置</h2>
  <p>本サービスが、お客様から取得した情報に関して安全管理のために講じた措置につきましては、末尾記載のお問い合わせ先にご連絡をいただきましたら、法令の定めに従い個別にご回答させていただきます。</p>

  <h2>第三者提供</h2>
  <p>本サービスは、お客様から取得する情報のうち、個人データ（個人情報保護法第１６条第３項）に該当するものついては、あらかじめお客様の同意を得ずに、第三者（日本国外にある者を含みます。）に提供しません。但し、次の場合は除きます:</p>
  <ul>
    <li>個人データの取扱いを外部に委託する場合</li>
    <li>本サービスが買収された場合</li>
    <li>事業パートナーと共同利用する場合（具体的な共同利用がある場合は、その内容を別途公表します。）</li>
    <li>その他、法律によって合法的に第三者提供が許されている場合（警察からの照会等）</li>
  </ul>

  <h2>当サイトに掲載されている広告について</h2>
  当サイトでは、第三者配信の広告サービス（Googleアドセンス）を利用しています。 このような広告配信事業者は、ユーザーの興味に応じた商品やサービスの広告を表示するため、当サイトや他サイトへのアクセスに関する情報 『Cookie』(氏名、住所、メール アドレス、電話番号は含まれません) を使用することがあります。 またGoogleアドセンスに関して、このプロセスの詳細やこのような情報が広告配信事業者に使用されないようにする方法については、<a href="https://policies.google.com/technologies/ads?gl=jp" target=”_blank” rel=”noopener”>こちら</a>をクリックしてください。

  <h2>当サイトが使用しているアクセス解析ツールについて</h2>
  当サイトでは、Googleによるアクセス解析ツール「Googleアナリティクス」を利用しています。 このGoogleアナリティクスはトラフィックデータの収集のためにCookieを使用しています。 このトラフィックデータは匿名で収集されており、個人を特定するものではありません。 この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。 この規約に関して、詳しくは<a href=”https://marketingplatform.google.com/about/analytics/terms/jp/” target=”_blank” rel=”noopener”>こちら</a>をクリックしてください。

  <h2>プライバシーポリシーの変更</h2>
  <p>本サービスは、必要に応じて、このプライバシーポリシーの内容を変更します。この場合、変更後のプライバシーポリシーの施行時期と内容を適切な方法により周知または通知します。</p>

  <h2>お問い合わせ</h2>
  <p>お客様の情報の開示、情報の訂正、利用停止、削除をご希望の場合は、以下のメールアドレスにご連絡ください。</p>
  <p>E-mail: <a href="mailto:tuita-sns@outlook.com">tuita-sns@outlook.com</a></p>
  <p>この場合、必ず本サービスが指定する方法により、ご本人からのご請求であることの確認をさせていただきます。なお、情報の開示請求については、開示の有無に関わらず、ご申請時に一件あたり1,000円の事務手数料を申し受けます。</p>

  <p>最終更新日: 2023年9月25日</p>


</template>

<style scoped>
* {
  margin: 0;
  padding: 0;
  box-sizing: border-box;
  font-family: "Roboto", sans-serif;
}

body {
  margin-top: 5rem;
}

/* Privacy Policy page styles */
h1, h2 {
  margin-bottom: 1rem;
}

p {
  margin-bottom: 0.5rem;
}

ul, ol {
  margin-bottom: 1rem;
  margin-left: 1.5rem;
}

a {
  color: #007BFF;
  text-decoration: underline;
}

a:hover {
  color: #0056b3;
}


</style>
